tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "romkatv/powerlevel10k"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Object-relational database system
brew "postgresql@15"
# Python version management
brew "pyenv"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Apple TV Aerial screensaver
cask "aerial"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn"
# E-books management software
cask "calibre"
# Two-panel file manager
cask "commander-one"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# This cask follows releases from https://github.com/dotnet/core/tree/master
cask "dotnet-sdk5-0-400"
# Web browser
cask "firefox"
# Version of Cascadia Code with embedded Powerline symbols
cask "font-cascadia-code-pl"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# .NET IDE
cask "rider"
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
mas "Amphetamine", id: 937984704
mas "LINE", id: 539883307
mas "Spark", id: 1176895641
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.Bookmarks"
vscode "bajdzis.vscode-database"
vscode "bmuskalla.vscode-tldr"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "dhedgecock.radical-vscode"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GrapeCity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "kevinkyang.auto-comment-blocks"
vscode "lehni.vscode-fix-checksums"
vscode "liviuschera.noctis"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pranaygp.vscode-css-peek"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "sdras.night-owl"
vscode "TabNine.tabnine-vscode"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "Yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
vscode "yzhang.markdown-all-in-one"
